In [70]:
import numpy as np
import sklearn as sk
import matplotlib.pyplot as plt
%matplotlib inline
import scipy as sc
import seaborn as sb
import pandas as pd
print (np.__version__)
print (sk.__version__)
#print (plt.__version__)
print (sc.__version__)
print (sb.__version__)
print (pd.__version__)

1.20.3
0.24.2
1.7.1
0.11.2
1.3.4

In [71]:
house=pd.read_csv('Bengaluru_House_Data.csv')
house.head(10)

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00
5,Super built-up Area,Ready To Move,Whitefield,2 BHK,DuenaTa,1170,2.0,1.0,38.00
6,Super built-up Area,18-May,Old Airport Road,4 BHK,Jaades,2732,4.0,NaN,204.00
7,Super built-up Area,Ready To Move,Rajaji Nagar,4 BHK,Brway G,3300,4.0,NaN,600.00
8,Super built-up Area,Ready To Move,Marathahalli,3 BHK,NaN,1310,3.0,1.0,63.25
9,Plot Area,Ready To Move,Gandhi Bazar,6 Bedroom,NaN,1020,6.0,NaN,370.00

In [72]:
print(house.shape)
house.info()
house.describe()

(13320, 9)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

               bath       balcony         price
count  13247.000000  12711.000000  13320.000000
mean       2.692610      1.584376    112.565627
std        1.341458      0.817263    148.971674
min        1.000000      0.000000      8.000000
25%        2.000000      1.000000     50.000000
50%        2.000000      2.000000     72.000000
75%        3.000000      2.000000    120.000000
max       40.000000      3.000000   3600.000000

In [73]:
for columns in house.columns:
    print(house[columns].value_counts())
    print(30*'#')

Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: area_type, dtype: int64
##############################
Ready To Move    10581
18-Dec             307
18-May             295
18-Apr             271
18-Aug             200
                 ...
15-Aug               1
17-Jan               1
16-Nov               1
16-Jan               1
14-Jul               1
Name: availability, Length: 81, dtype: int64
##############################
Whitefield                        540
Sarjapur  Road                    399
Electronic City                   302
Kanakpura Road                    273
Thanisandra                       234
                                 ...
Bapuji Layout                       1
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
singapura paradise                  1
Abshot Layout                       1
Name: location, Length: 1305, dtype: int64
##############################
2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
11 Bedroom       2
10 BHK           2
14 BHK           1
13 BHK           1
12 Bedroom       1
27 BHK           1
43 Bedroom       1
16 BHK           1
19 BHK           1
18 Bedroom       1
Name: size, dtype: int64
##############################
GrrvaGr    80
PrarePa    76
Sryalan    59
Prtates    59
GMown E    56
           ..
Amionce     1
JaghtDe     1
Jauraht     1
Brity U     1
RSntsAp     1
Name: society, Length: 2688, dtype: int64
##############################
1200    843
1100    221
1500    205
2400    196
600     180
       ...
3580      1
2461      1
1437      1
2155      1
4689      1
Name: total_sqft, Length: 2117, dtype: int64
##############################
2.0     6908
3.0     3286
4.0     1226
1.0      788
5.0      524
6.0      273
7.0      102
8.0       64
9.0       43
10.0      13
12.0       7
13.0       3
11.0       3
16.0       2
27.0       1
40.0       1
15.0       1
14.0       1
18.0       1
Name: bath, dtype: int64
##############################
2.0    5113
1.0    4897
3.0    1672
0.0    1029
Name: balcony, dtype: int64
##############################
75.00     310
65.00     302
55.00     275
60.00     270
45.00     240
         ...
351.00      1
54.10       1
80.64       1
32.73       1
488.00      1
Name: price, Length: 1994, dtype: int64
##############################

In [74]:
house.isnull().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [75]:
house['location']=house['location'].fillna(method='pad')
house['location'].isnull().sum()

0

In [76]:
house[house['size'].isnull()].values.tolist()

[['Plot  Area',
  'Immediate Possession',
  'Sarjapur  Road',
  nan,
  'Asiss B',
  '1200 - 2400',
  nan,
  nan,
  34.185],
 ['Plot  Area',
  'Immediate Possession',
  'IVC Road',
  nan,
  'Orana N',
  '2000 - 5634',
  nan,
  nan,
  124.0],
 ['Plot  Area',
  'Immediate Possession',
  'Banashankari',
  nan,
  nan,
  '2400',
  nan,
  nan,
  460.0],
 ['Plot  Area',
  'Immediate Possession',
  'Sarjapur  Road',
  nan,
  'AsdiaAr',
  '1200 - 2400',
  nan,
  nan,
  28.785],
 ['Plot  Area',
  'Immediate Possession',
  'Devanahalli',
  nan,
  'Ajleyor',
  '1500 - 2400',
  nan,
  nan,
  46.8],
 ['Plot  Area',
  'Immediate Possession',
  'Devanahalli',
  nan,
  'Emngs S',
  '2100 - 5405',
  nan,
  nan,
  177.115],
 ['Plot  Area',
  'Immediate Possession',
  'Whitefield',
  nan,
  'SRniaGa',
  '2324',
  nan,
  nan,
  26.73],
 ['Plot  Area',
  'Immediate Possession',
  'Jigani',
  nan,
  'S2enste',
  '1500',
  nan,
  nan,
  25.49],
 ['Plot  Area',
  'Immediate Possession',
  'Hoskote',
  nan,
  'SJowsn ',
  '800 - 2660',
  nan,
  nan,
  28.545],
 ['Plot  Area',
  'Immediate Possession',
  'Kasavanhalli',
  nan,
  nan,
  '5000',
  nan,
  nan,
  400.0],
 ['Plot  Area',
  'Immediate Possession',
  'Anekal',
  nan,
  'Vaensnd',
  '1453',
  nan,
  nan,
  16.5],
 ['Plot  Area',
  'Immediate Possession',
  'Carmelaram',
  nan,
  'Ocezes ',
  '2000',
  nan,
  nan,
  120.0],
 ['Plot  Area',
  'Immediate Possession',
  'Mysore Road',
  nan,
  'Naoden ',
  '1200 - 2400',
  nan,
  nan,
  42.3],
 ['Plot  Area',
  'Immediate Possession',
  'Rajankunte',
  nan,
  nan,
  '1575',
  nan,
  nan,
  31.11],
 ['Plot  Area',
  'Immediate Possession',
  'Yelahanka',
  nan,
  'Saaveha',
  '1200 - 1800',
  nan,
  nan,
  12.75],
 ['Plot  Area',
  'Immediate Possession',
  'Hosur Road',
  nan,
  'AVeldun',
  '1350',
  nan,
  nan,
  8.44]]

In [77]:
house[house['size'].isnull()].index.tolist()

[579,
 1775,
 2264,
 2809,
 2862,
 5333,
 6423,
 6636,
 6719,
 7680,
 8306,
 8565,
 8703,
 10634,
 11019,
 11569]

In [78]:
house['size']=house['size'].fillna('2 BHK')
house['size'].isnull().sum()

0

In [79]:
house['bath']=house['bath'].fillna(house['bath'].median())
house['bath'].isnull().sum()

0

In [80]:
n_size=house['size'].str.split().str.get(0).astype(int)
print(n_size)

0        2
1        4
2        3
3        3
4        2
        ..
13315    5
13316    4
13317    2
13318    4
13319    1
Name: size, Length: 13320, dtype: int32

In [81]:
house.drop(['society','size'],axis=1,inplace=True)

In [82]:
house=pd.concat([house,n_size],axis=1)
house.head()

,area_type,availability,location,total_sqft,bath,balcony,price,size
0,Super built-up Area,19-Dec,Electronic City Phase II,1056,2.0,1.0,39.07,2
1,Plot Area,Ready To Move,Chikka Tirupathi,2600,5.0,3.0,120.00,4
2,Built-up Area,Ready To Move,Uttarahalli,1440,2.0,3.0,62.00,3
3,Super built-up Area,Ready To Move,Lingadheeranahalli,1521,3.0,1.0,95.00,3
4,Super built-up Area,Ready To Move,Kothanur,1200,2.0,1.0,51.00,2

In [83]:
house[n_size>20]

,area_type,availability,location,total_sqft,bath,balcony,price,size
1718,Super built-up Area,Ready To Move,2Electronic City Phase II,8000,27.0,0.0,230.0,27
4684,Plot Area,Ready To Move,Munnekollal,2400,40.0,0.0,660.0,43

In [84]:
house=house.drop(1718)

In [85]:
house=house.drop(4684)

In [86]:
house['total_sqft'].unique()               #it has range which is unacceptable

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [87]:
def convert(x):
    a=x.split('-')
    if len(a)==2:
        return(float(a[0])+float(a[1]))/2
    try:
        return float(x)
    except:
        return None

In [88]:
house['total_sqft']=house['total_sqft'].apply(convert)

In [89]:
house.shape

(13318, 8)

In [90]:
house['per_sq_foot']=house['price']*100000/house['total_sqft']

In [91]:
b=list(house['area_type'])
b= set (b)
print (b)
print (house['area_type'].unique())
print (house['area_type'].value_counts())

{'Plot  Area', 'Carpet  Area', 'Super built-up  Area', 'Built-up  Area'}
['Super built-up  Area' 'Plot  Area' 'Built-up  Area' 'Carpet  Area']
Super built-up  Area    8789
Built-up  Area          2418
Plot  Area              2024
Carpet  Area              87
Name: area_type, dtype: int64

In [92]:
#area=pd.get_dummies(house['area_type'],drop_first=True)
#print(area)

In [93]:
house["area_type"]=house["area_type"].replace(['Super built-up  Area'],0)
house["area_type"]=house["area_type"].replace(['Built-up  Area' ],1)
house["area_type"]=house["area_type"].replace(['Plot  Area'],2)
house["area_type"]=house["area_type"].replace(['Carpet  Area'],3)

In [94]:
house['area_type'].value_counts()

0    8789
1    2418
2    2024
3      87
Name: area_type, dtype: int64

In [95]:
house.head()

,area_type,availability,location,total_sqft,bath,balcony,price,size,per_sq_foot
0,0,19-Dec,Electronic City Phase II,1056.0,2.0,1.0,39.07,2,3699.810606
1,2,Ready To Move,Chikka Tirupathi,2600.0,5.0,3.0,120.00,4,4615.384615
2,1,Ready To Move,Uttarahalli,1440.0,2.0,3.0,62.00,3,4305.555556
3,0,Ready To Move,Lingadheeranahalli,1521.0,3.0,1.0,95.00,3,6245.890861
4,0,Ready To Move,Kothanur,1200.0,2.0,1.0,51.00,2,4250.000000

In [96]:
house['availability'].unique()
#house['availability'].value_counts()

array(['19-Dec', 'Ready To Move', '18-May', '18-Feb', '18-Nov', '20-Dec',
       '17-Oct', '21-Dec', '19-Sep', '20-Sep', '18-Mar', '20-Feb',
       '18-Apr', '20-Aug', '18-Oct', '19-Mar', '17-Sep', '18-Dec',
       '17-Aug', '19-Apr', '18-Jun', '22-Dec', '22-Jan', '18-Aug',
       '19-Jan', '17-Jul', '18-Jul', '21-Jun', '20-May', '19-Aug',
       '18-Sep', '17-May', '17-Jun', '21-May', '18-Jan', '20-Mar',
       '17-Dec', '16-Mar', '19-Jun', '22-Jun', '19-Jul', '21-Feb',
       'Immediate Possession', '19-May', '17-Nov', '20-Oct', '20-Jun',
       '19-Feb', '21-Oct', '21-Jan', '17-Mar', '17-Apr', '22-May',
       '19-Oct', '21-Jul', '21-Nov', '21-Mar', '16-Dec', '22-Mar',
       '20-Jan', '21-Sep', '21-Aug', '14-Nov', '19-Nov', '15-Nov',
       '16-Jul', '15-Jun', '17-Feb', '20-Nov', '20-Jul', '16-Sep',
       '15-Oct', '15-Dec', '16-Oct', '22-Nov', '15-Aug', '17-Jan',
       '16-Nov', '20-Apr', '16-Jan', '14-Jul'], dtype=object)

In [97]:
house.drop(["availability"],axis=1,inplace=True)

In [98]:
house['location'].value_counts()

Whitefield                            540
Sarjapur  Road                        400
Electronic City                       302
Kanakpura Road                        273
Thanisandra                           234
                                     ...
 Whitefield                             1
Kengeri Satellite Town ( BDA SITE)      1
Indiranagar HAL 2nd Stage               1
K R C kothanur                          1
Abshot Layout                           1
Name: location, Length: 1304, dtype: int64

In [99]:
house['location']=house['location'].apply(lambda x:x.strip())
loc=house['location'].value_counts()
loc_new=loc[loc<=10]
loc_new

Dairy Circle                      10
Nagappa Reddy Layout              10
Basapura                          10
1st Block Koramangala             10
Sector 1 HSR Layout               10
                                  ..
Vasantapura main road              1
Bapuji Layout                      1
1st Stage Radha Krishna Layout     1
BEML Layout 5th stage              1
Abshot Layout                      1
Name: location, Length: 1052, dtype: int64

In [100]:
house['location']=house['location'].apply(lambda x:'other' if x in loc_new else x)

In [101]:
house['location'].value_counts()

other                 2884
Whitefield             541
Sarjapur  Road         400
Electronic City        304
Kanakpura Road         273
                      ...
Nehru Nagar             11
Banjara Layout          11
LB Shastri Nagar        11
Pattandur Agrahara      11
Narayanapura            11
Name: location, Length: 242, dtype: int64

In [102]:
#house.head()

In [103]:
house['balcony'].unique()

array([ 1.,  3., nan,  2.,  0.])

In [104]:
house['balcony'].value_counts()

2.0    5113
1.0    4897
3.0    1672
0.0    1027
Name: balcony, dtype: int64

In [105]:
house.drop(['balcony'],axis=1,inplace=True)

In [106]:
house.head()

,area_type,location,total_sqft,bath,price,size,per_sq_foot
0,0,Electronic City Phase II,1056.0,2.0,39.07,2,3699.810606
1,2,Chikka Tirupathi,2600.0,5.0,120.00,4,4615.384615
2,1,Uttarahalli,1440.0,2.0,62.00,3,4305.555556
3,0,Lingadheeranahalli,1521.0,3.0,95.00,3,6245.890861
4,0,Kothanur,1200.0,2.0,51.00,2,4250.000000

In [107]:
house.isnull().sum()

area_type       0
location        0
total_sqft     46
bath            0
price           0
size            0
per_sq_foot    46
dtype: int64

In [108]:
house.dropna(how='any',axis=0,inplace=True)

In [109]:
house.isnull().sum()

area_type      0
location       0
total_sqft     0
bath           0
price          0
size           0
per_sq_foot    0
dtype: int64

In [110]:
house.shape

(13272, 7)

In [111]:
house.describe()

,area_type,total_sqft,bath,price,size,per_sq_foot
count,13272.000000,13272.000000,13272.000000,13272.000000,13272.000000,1.327200e+04
mean,0.502712,1559.078114,2.682715,112.403542,2.796866,7.906404e+03
std,0.768900,1237.214493,1.279108,149.002311,1.225786,1.064375e+05
min,0.000000,1.000000,1.000000,8.000000,1.000000,2.678298e+02
25%,0.000000,1100.000000,2.000000,50.000000,2.000000,4.267260e+03
50%,0.000000,1276.000000,2.000000,72.000000,3.000000,5.434306e+03
75%,1.000000,1680.000000,3.000000,120.000000,3.000000,7.311582e+03
max,3.000000,52272.000000,18.000000,3600.000000,19.000000,1.200000e+07

In [112]:
(house['total_sqft']/house['size']).describe()

count    13272.000000
mean       575.135008
std        388.200711
min          0.250000
25%        473.333333
50%        552.500000
75%        625.000000
max      26136.000000
dtype: float64

In [113]:
house=house[((house['total_sqft']/house['size'])>=300)]
house.describe()

,area_type,total_sqft,bath,price,size,per_sq_foot
count,12530.000000,12530.000000,12530.000000,12530.000000,12530.000000,12530.000000
mean,0.426895,1594.564544,2.559537,111.382401,2.650838,6303.979357
std,0.710543,1261.271296,1.077938,152.077329,0.976678,4162.237981
min,0.000000,300.000000,1.000000,8.440000,1.000000,267.829813
25%,0.000000,1116.000000,2.000000,49.000000,2.000000,4210.526316
50%,0.000000,1300.000000,2.000000,70.000000,3.000000,5294.117647
75%,1.000000,1700.000000,3.000000,115.000000,3.000000,6916.666667
max,3.000000,52272.000000,16.000000,3600.000000,16.000000,176470.588235

In [114]:
def remove_outliers_sqft(df):
    df_out=pd.DataFrame()
    for name,group in df.groupby('location'):
        mean=np.mean(group.per_sq_foot)
        std=np.std(group.per_sq_foot)
        new_df=group[(group.per_sq_foot > (mean-std)) & (group.per_sq_foot <= (mean+std))]
        df_out=pd.concat([df_out,new_df],ignore_index=True)
    return df_out
house=remove_outliers_sqft(house)
house.describe()

,area_type,total_sqft,bath,price,size,per_sq_foot
count,10301.000000,10301.000000,10301.000000,10301.000000,10301.000000,10301.000000
mean,0.355985,1508.440608,2.471702,91.286372,2.574896,5659.062876
std,0.642326,880.694214,0.979449,86.342786,0.897649,2265.774749
min,0.000000,300.000000,1.000000,10.000000,1.000000,1250.000000
25%,0.000000,1110.000000,2.000000,49.000000,2.000000,4244.897959
50%,0.000000,1286.000000,2.000000,67.000000,2.000000,5175.600739
75%,1.000000,1650.000000,3.000000,100.000000,3.000000,6428.571429
max,3.000000,30400.000000,16.000000,2200.000000,16.000000,24509.803922

In [115]:
def size_outlier(df):
    exclude=np.array([])
    for location,location_df in df.groupby('location'):
        size_vals={}
        for size,size_df in location_df.groupby('size'):
            size_vals[size]={
                'mean':np.mean(size_df.per_sq_foot),
                'std':np.std(size_df.per_sq_foot),
                'count':size_df.shape[0]
            }
        #print(location,size_vals)
        for size,size_df in location_df.groupby('size'):
            vals=size_vals.get(size-1)
            if vals and vals['count']>5:
                exclude=np.append(exclude,size_df[size_df.per_sq_foot<(vals['mean'])].index.values)
    return df.drop(exclude,axis='index')

In [116]:
house=size_outlier(house)

In [117]:
house.shape

(7360, 7)

In [118]:
#from sklearn.preprocessing import LabelEncoder
#en=LabelEncoder()
#input=house['location']
#encoded=en.fit_transform(input)
#print("encoded:",list(encoded))

In [119]:
#encoded=list(encoded)

In [120]:
#encoded=pd.DataFrame(encoded,columns=['encoded_location'])

In [121]:
#house=pd.concat([house,encoded],axis=1)

In [122]:
#house['encoded_location'].unique()

In [123]:
#house['encoded_location'].value_counts()

In [124]:
house.drop(['per_sq_foot'],axis=1,inplace=True)

In [125]:
house.head()

   area_type             location  total_sqft  bath  price  size
0          0  1st Block Jayanagar      2850.0   4.0  428.0     4
1          0  1st Block Jayanagar      1630.0   3.0  194.0     3
2          0  1st Block Jayanagar      1875.0   2.0  235.0     3
3          1  1st Block Jayanagar      1200.0   2.0  130.0     3
4          0  1st Block Jayanagar      1235.0   2.0  148.0     2

In [126]:
house.describe()

         area_type    total_sqft         bath        price         size
count  7360.000000   7360.000000  7360.000000  7360.000000  7360.000000
mean      0.364946   1496.928526     2.448098    99.094892     2.500543
std       0.658162    865.839979     1.011563    93.343057     0.929357
min       0.000000    300.000000     1.000000    10.000000     1.000000
25%       0.000000   1095.750000     2.000000    50.000000     2.000000
50%       0.000000   1260.000000     2.000000    73.100000     2.000000
75%       1.000000   1680.000000     3.000000   113.000000     3.000000
max       3.000000  30000.000000    16.000000  2200.000000    16.000000

In [127]:
x=house.drop(['price'],axis=1)
y=house['price']

In [128]:
house.isnull().sum()

area_type     0
location      0
total_sqft    0
bath          0
price         0
size          0
dtype: int64

In [129]:
house.dropna(how='any',axis=0,inplace=True)
house.isnull().sum()

area_type     0
location      0
total_sqft    0
bath          0
price         0
size          0
dtype: int64

In [130]:
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split
from numpy import set_printoptions

In [131]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.3,random_state=0)
set_printoptions(precision=2)
print(x_train.shape)
print(x_test.shape)
print(y_train.shape)
print(y_test.shape)
print(x_train)
print(y_train)
print(x_test)
print(y_test)

(5152, 5)
(2208, 5)
(5152,)
(2208,)
      area_type           location  total_sqft  bath  size
862           0  Bannerghatta Road       892.0   2.0     2
8016          0              other      1413.0   2.0     3
7355          0         Whitefield       709.0   1.0     1
3738          0             Jigani      1221.0   3.0     3
635           0       Babusapalaya      1061.0   2.0     2
...         ...                ...         ...   ...   ...
6062          0           Sarjapur      1175.0   2.0     2
3985          0          Kambipura       883.0   2.0     2
2007          0    Electronic City      1575.0   3.0     3
3197          0              Hoodi       706.0   1.0     1
3342          0          Hosa Road      1243.0   2.0     2

[5152 rows x 5 columns]
862     39.000
8016    75.000
7355    34.385
3738    70.000
635     38.950
         ...
6062    41.680
3985    39.000
2007    90.000
3197    48.240
3342    48.500
Name: price, Length: 5152, dtype: float64
       area_type               location  total_sqft  bath  size
7154           0            Vijayanagar      1200.0   2.0     2
7950           0           Yeshwanthpur       669.0   1.0     1
6842           1                 Tindlu      7500.0   7.0     7
9095           1                  other      1200.0   1.0     1
8615           0                  other      1340.0   3.0     3
...          ...                    ...         ...   ...   ...
5711           0  Raja Rajeshwari Nagar      1110.0   2.0     2
9874           0                  other       509.0   1.0     1
9509           2                  other      1000.0   2.0     2
5603           0  Raja Rajeshwari Nagar      1133.0   2.0     2
10236          0                  other       450.0   1.0     1

[2208 rows x 5 columns]
7154      62.00
7950      36.85
6842     400.00
9095      69.00
8615      77.00
          ...
5711      52.00
9874      20.00
9509      55.00
5603      49.07
10236     20.00
Name: price, Length: 2208, dtype: float64

In [132]:
#np.any(np.isnan(house))

In [133]:
#np.all(np.isfinite(house))

In [134]:
#na=np.where(np.isnan(house))
#print (na)

In [135]:
#inf=np.where(np.isinf(house))
#print (inf)

In [136]:
#np.finfo(np.float64)

In [137]:
house.head()

   area_type             location  total_sqft  bath  price  size
0          0  1st Block Jayanagar      2850.0   4.0  428.0     4
1          0  1st Block Jayanagar      1630.0   3.0  194.0     3
2          0  1st Block Jayanagar      1875.0   2.0  235.0     3
3          1  1st Block Jayanagar      1200.0   2.0  130.0     3
4          0  1st Block Jayanagar      1235.0   2.0  148.0     2

In [140]:
from sklearn.linear_model import LinearRegression
from sklearn.compose import make_column_transformer
from sklearn.pipeline import make_pipeline
from sklearn.preprocessing import StandardScaler, OneHotEncoder
column_trans=make_column_transformer((OneHotEncoder(sparse=False),['location']),remainder='passthrough')
Scaler=StandardScaler()
lr=LinearRegression(normalize=True)
pipe=make_pipeline(column_trans,Scaler,lr)
pipe.fit(x_train,y_train)
y_pred=pipe.predict(x_test)
from sklearn.metrics import r2_score
#print(classification_report(y_test,y_pred))
#print(confusion_matrix(y_test,y_pred))
print(r2_score(y_test,y_pred)*100)

84.37382900612769